Revit 2026 API

# MEPSystemElements Property

---

Terminal elements in the system.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementSet Elements { get; }
```
```vb
Public ReadOnly Property Elements As ElementSet
	Get
```
```cpp
public:
property ElementSet^ Elements {
	ElementSet^ get ();
}
```
```fsharp
member Elements : ElementSet with get
```

#### Property Value

ElementSet

The return value is a read only collection and doesn't include the base equipment or panel.

#### Reference

MEPSystem Class

Autodesk.Revit.DB Namespace